
# '''
# 销售员:
# 《槽位id: 853664》[360促动支2CALL初版][核身:核身 - 有姓名][Q:是否本人接听电话 - 有姓名] @  # 开场-黄先生||您好，请问您是黄先生吗？（核实姓即可） #@@no_handle_quiet@ 0
# 用户:
# 嗯，对
# 销售员:
# 《槽位id: 928463》[坐席询问用户: 是否本人接听电话 - 用户肯定][开场常规首句][Q:简单了解是否可以] @  # CDZ14-0712-1C||诶～您好，这里是360借条，今天给您带来额度免费使用15天的周转金免息福利，您简单了解一下好吧？#@ 4
# 用户:
# [不需要 - 无原因]
# 不要。
# 用户:
# 有没有两百万，有两百万才借
# 销售员:
# 《槽位id: 1007046》[坐席询问用户: 是否可以简单了解 - 用户无明确回应][Q: 再次劝服简单了解]
# @# CDZ22-1C||是这样的，今天不仅给您带来了15天的免息券，同时还有机会获得更高额度更低费用，具体系统审核为准，您先了解一下好吧？#@@@transfer@@{transfer_success-CDZ1000-1C||好的，您不要挂机，马上为您服务@@notbreak@@} 16
# '''
